Autodesk.Revit.DB.RevitLinkGraphicsSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkVisibilityType
The visibility type of RevitLinkGraphicsSettings.
If the type is set to Autodesk.Revit.DB.LinkVisibility.ByHostView or
Autodesk.Revit.DB.LinkVisibility.ByLinkView, then the dependent properties
of RevitLinkGraphicsSettings will be reset to their default state. The state of dependent properties can be changed later.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkedViewId
The id of the linked view associated with this RevitLinkGraphicsSettings,
or Autodesk.Revit.DB.ElementId.InvalidElementId if no view is selected.
If the Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkVisibilityType is set to
Autodesk.Revit.DB.LinkVisibility.ByLinkView, then there must be a valid LinkedViewId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.RevitLinkGraphicsSettings.#ctor
Creates a new RevitLinkGraphicsSettings instance.
Since:
2024

Autodesk.Revit.DB.RevitLinkGraphicsSettings
Settings to override display of Revit link in a view.
Since:
2024